# Exploring Pandas functoins

In [ ]:
import pandas as pd

In [6]:
pd.DataFrame(
    {
        "A":[1,2,3],
        "B":[4,5,6]
    }
)

   A  B
0  1  4
1  2  5
2  3  6

# Data Exploding

In [9]:
import numpy as np

In [10]:
df = pd.DataFrame(
    {
        'A':[
            [0,1,2], 
            'foo', 
            [], 
            [3,4]
        ],
        
        'B': 1,
        
        'C': [
            ['a', 'b', 'c'], 
            np.nan, 
            [], 
            ['d', 'e']
        ]
    }
)

In [11]:
df

           A  B          C
0  [0, 1, 2]  1  [a, b, c]
1        foo  1        NaN
2         []  1         []
3     [3, 4]  1     [d, e]

In [12]:
df.explode("A")  # exploading A content and dublicate the rest of columns

     A  B          C
0    0  1  [a, b, c]
0    1  1  [a, b, c]
0    2  1  [a, b, c]
1  foo  1        NaN
2  NaN  1         []
3    3  1     [d, e]
3    4  1     [d, e]

# json normalize

In [14]:
data = [
    {
        "id": 1,
        "name": "eraki",
        "fitness": {"height": 178, "weight": 70},
    },
    {
        "name": "ahmed",
        "fitness": {"height": 168, "weight": 60},
    },
    {
        "id": 2,
        "name": "mostafa",
        "fitness": {"height": 168, "weight": 90},       
    }
]

In [15]:
pd.json_normalize(data)

    id     name  fitness.height  fitness.weight
0  1.0    eraki             178              70
1  NaN    ahmed             168              60
2  2.0  mostafa             168              90

In [16]:
pd.DataFrame(data)

    id     name                        fitness
0  1.0    eraki  {'height': 178, 'weight': 70}
1  NaN    ahmed  {'height': 168, 'weight': 60}
2  2.0  mostafa  {'height': 168, 'weight': 90}

In [17]:
jn = pd.json_normalize(data)

In [19]:
csv = jn.to_csv()
print(csv)

,id,name,fitness.height,fitness.weight
0,1.0,eraki,178,70
1,,ahmed,168,60
2,2.0,mostafa,168,90